Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionOrthogonal.Attributes Property
 Gets or sets the curved dimension set orthogonal attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes Attributes { get; set; }
Public Property Attributes As CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
	Get
	Set
Property Value
Type: CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
See Also
Reference
CurvedDimensionOrthogonal Class
Tekla.Structures.Drawing Namespace